<a href="https://colab.research.google.com/github/hihunjin/Code-snippet-for-everything/blob/main/pandas/df_stratified_sampling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(dict(
        A=[1, 1, 1, 2, 2, 2, 2, 3, 4, 4],
        B=range(10)
    ))

In [4]:
df

   A  B
0  1  0
1  1  1
2  1  2
3  2  3
4  2  4
5  2  5
6  2  6
7  3  7
8  4  8
9  4  9

### Stratified sampling

In [5]:
df.groupby('A', group_keys=False).apply(lambda x: x.sample(min(len(x), 2)))

   A  B
2  1  2
0  1  0
5  2  5
6  2  6
7  3  7
9  4  9
8  4  8

### What "groupby" do?

In [6]:
df.groupby('A', group_keys=False).head()

   A  B
0  1  0
1  1  1
2  1  2
3  2  3
4  2  4
5  2  5
6  2  6
7  3  7
8  4  8
9  4  9

In [7]:
df.groupby('A', group_keys=False).apply(lambda x: len(x))

A
1    3
2    4
3    1
4    2
dtype: int64